---
kind: property
id: P:Autodesk.Revit.DB.Structure.ConnectionInputPoint.Point
zh: 点
source: html/10681da3-0ff3-b748-94e4-87c8beaf8e64.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPoint.Point Property

**中文**: 点

3d position of this input point.

## Syntax (C#)
```csharp
public XYZ Point { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null